Webahh/embedded_signlanguage_translator/embedded/STM32N6570DK/FSBL/Src/Drivers/Simple/Src/simple_scheduler.c
/**
 * @file    simple_scheduler.c
 * @author  Gross
 * @date    05.06.2026
 * @brief   Priority preemptive scheduler driver source
 */

#include <stdint.h>
#include <stddef.h>

#include "stm32n657xx.h"

#include "simple_scheduler.h"
#include "simple_timer.h"
#include "simple_debug_log.h"
#include "config.h"

// -------------------------------------------------------------------------
// Private defines / datatypes
// -------------------------------------------------------------------------

typedef struct {
	SCHEDULER_TaskFunction_TypeDef	function;			//  0
	uint32_t						period_ms;			//  4
	uint32_t						last_run_ms;		//  8
	uint8_t							priority;			// 12
	uint8_t							ready;				// 13
	uint8_t							active;				// 14
	uint8_t							needs_init;			// 15
	uint8_t							stack_overflow;		// 16
	uint32_t						saved_sp;			// 20 (aligned)
	uint32_t						saved_exc_return;	// 24
	const char*						pcName;				// 28
} _TaskHandle_TypeDef;							// 32 bytes

// TCB = Task Control Block
#define _TCB_SIZE		32
#define _TCB_SAVED_SP	20
#define _TCB_EXC_RETURN	24
#define _TCB_NEEDS_INIT	15

// Stringify helper for inline assembly
#define _STR_HELPER(x) #x
#define _STR(x)        _STR_HELPER(x)

_Static_assert(offsetof(_TaskHandle_TypeDef, saved_sp) == _TCB_SAVED_SP, "TCB saved_sp offset mismatch with assembly");
_Static_assert(offsetof(_TaskHandle_TypeDef, saved_exc_return) == _TCB_EXC_RETURN, "TCB saved_exc_return offset mismatch with assembly");
_Static_assert(offsetof(_TaskHandle_TypeDef, needs_init) == _TCB_NEEDS_INIT, "TCB needs_init offset mismatch with assembly");
_Static_assert(sizeof(_TaskHandle_TypeDef) == _TCB_SIZE, "TCB size mismatch with assembly");

// -------------------------------------------------------------------------
// Private data
// -------------------------------------------------------------------------

static _TaskHandle_TypeDef	_tasks[SCHEDULER_MAX_TASKS];
static volatile uint32_t	_sys_tick_ms = 0;
static int					_current_task = 0;

static volatile int			_scheduler_running = 0;

typedef struct {
	uint32_t					total_cycles;
	uint32_t					total_preempts;
	uint32_t					total_invocations;
	uint32_t					min_cycles;
	uint32_t					max_cycles;
	uint32_t					last_start_cycle;
} Scheduler_Task_Stats_TypeDef;

static Scheduler_Task_Stats_TypeDef	_task_stats[SCHEDULER_MAX_TASKS];
static uint32_t						_last_stats_print_cycle;
static volatile int					_stats_pending;

// ISR cycle tracking (written by ISR_enter/exit, consumed by PendSV and PrintStats)
static volatile uint32_t			_isr_total_cycles;
static volatile int					_isr_nest;
static volatile uint32_t			_isr_entry_cycle;
static volatile int					_isr_owner_task;
static volatile uint32_t			_task_isr_cycles[SCHEDULER_MAX_TASKS];

// Diagnostic: counts how many times WFI returns per stats window
static uint32_t						_idle_wakeups;

static uint32_t _task_stacks[SCHEDULER_MAX_TASKS][SCHEDULER_DEFAULT_STACK_SIZE] __attribute__((aligned(8)));

_Static_assert(sizeof(_task_stacks[0]) == SCHEDULER_STACK_SIZE_BYTES,"SCHEDULER_STACK_SIZE_BYTES mismatch");

volatile Scheduler_Fault_Dump_TypeDef g_sched_fault;

// Forward declarations (called from assembly)
void SCHEDULER_Task_exit(void);
static int SCHEDULER_SelectNextTask(void);
void SCHEDULER_ReinitTask(int task_idx, uint32_t tcb_addr);
void SCHEDULER_FaultHandler_C(uint32_t exc_return, uint32_t *frame, uint32_t reason);
void SCHEDULER_StartTick(void);
static void SCHEDULER_PrintStats(void);

void UsageFault_Handler(void);
void HardFault_Handler(void);
void MemManage_Handler(void);
void BusFault_Handler(void);
void NMI_Handler(void);

// -------------------------------------------------------------------------
// Stack initialisation
// -------------------------------------------------------------------------

/**
 * @brief Initializes Task by filling with default values
 *
 * @param i | task index
 */
static void SCHEDULER_InitTaskStack(int i){
	uint32_t *stack_base = (uint32_t *)((uint32_t)_task_stacks[i] & ~7U);

	for (uint32_t j = 0; j < SCHEDULER_DEFAULT_STACK_SIZE; j++) {
		stack_base[j] = 0xA5A5A5A5;
	}

	uint32_t *stack_end = (uint32_t *)(((uint32_t)_task_stacks[i] + sizeof(_task_stacks[i])) & ~7U);
	uint32_t *sp = stack_end - 32;

	// sp[0..15]  S16-S31  (FPU callee-saved)
	// sp[16..23] R4-R11   (core callee-saved)
	// sp[24..31] exception frame: R0-R3, R12, LR, PC, xPSR

	sp[29] = (uint32_t)SCHEDULER_Task_exit; // LR on task return
	sp[30] = (uint32_t)_tasks[i].function;  // PC
	sp[31] = 0x01000000UL;                  // xPSR (thumb bit)

	_tasks[i].saved_sp         = (uint32_t)&sp[16];
	_tasks[i].saved_exc_return = 0xFFFFFFFDUL;
	_tasks[i].needs_init       = 0;
}

// -------------------------------------------------------------------------
// Idle task
// -------------------------------------------------------------------------

/**
 * @brief Idle task - waits for the next interrupt
 */
__attribute__((noreturn)) static void SCHEDULER_IdleTask(void){
	while (1) {
		if (_stats_pending) {
			_stats_pending = 0;
			SCHEDULER_PrintStats();
			_idle_wakeups = 0;
		}
		_idle_wakeups++;
		__WFI();
	}
}

// -------------------------------------------------------------------------
// Task exit handler
// -------------------------------------------------------------------------

/**
 * @brief Clean up and park the current task after it returns
 */
void SCHEDULER_Task_exit(void){
	__disable_irq();
	_tasks[_current_task].ready      = 0;
	_tasks[_current_task].needs_init = 1;

	SCB->ICSR |= SCB_ICSR_PENDSVSET_Msk;
	__enable_irq();

	while (1) {
		__WFI();
	}
}

// -------------------------------------------------------------------------
// Scheduling policy
// -------------------------------------------------------------------------

/**
 * @brief Selects next task with round robin and priority scheduling
 *
 * Chooses the highest-priority task that is both active and ready.
 * Tasks are scanned starting from the task immediately after the
 * currently running task and wrap around the task table, providing
 * round-robin fairness among tasks with the same priority.
 *
 * @return index of next Task to run
 */
static int SCHEDULER_SelectNextTask(void){
	int best = -1;
	uint8_t best_prio = 0xFF;

