Webahh/embedded_signlanguage_translator/embedded/STM32N6570DK/FSBL/Src/Drivers/Simple/Src/simple_scheduler.c
	uint32_t now = DWT->CYCCNT;
	uint32_t elapsed = now - _last_stats_print_cycle;
	_last_stats_print_cycle = now;

	uint32_t now_tick = _sys_tick_ms;
	uint32_t elapsed_ms = now_tick - _last_stats_tick;
	_last_stats_tick = now_tick;

	// Fill stat snapshots with data
	for (int i = 0; i < SCHEDULER_MAX_TASKS; i++) {
		if (i == SCHEDULER_IDLE_TASK_INDEX) continue;
		if (_tasks[i].active && _tasks[i].function) {
			Scheduler_Task_Stats_TypeDef *s = &_task_stats[i];
			snap[snap_n].cycles = s->total_cycles;
			snap[snap_n].min_cycles = (s->min_cycles == 0xFFFFFFFF) ? 0 : s->min_cycles;
			snap[snap_n].max_cycles = s->max_cycles;
			snap[snap_n].preempts = s->total_preempts;
			snap[snap_n].invocs = s->total_invocations;
			snap[snap_n].name = _tasks[i].pcName ? _tasks[i].pcName : "?";
			total += s->total_cycles;
			s->total_cycles = 0;
			s->total_preempts = 0;
			s->total_invocations = 0;
			s->min_cycles = 0xFFFFFFFF;
			s->max_cycles = 0;
			s->last_start_cycle = now;
			snap_n++;
		}
	}

	uint32_t isr_snapshot = _isr_total_cycles;
	_isr_total_cycles = 0;
	uint32_t idle = (elapsed > (total + isr_snapshot)) ? (elapsed - total - isr_snapshot) : 0;
	__enable_irq();

	if (elapsed == 0) {
		return;
	}

	DEBUG_PRINTF("\r\n");
	DEBUG_PRINTF("%-14.14s %-10s %-10s %-10s %-10s %-7s %-9s %-8s\r\n",
		"Name", "cycle", "min", "max", "avg", "%ACT", "Prempt", "Invoc");
	DEBUG_PRINTF("---------------------------------------------------------------------------------------\r\n");

	for (int i = 0; i < snap_n; i++) {
		uint32_t avg = snap[i].invocs ? (snap[i].cycles / snap[i].invocs) : 0;
		DEBUG_PRINTF("%-14.14s %10lu %10lu %10lu %10lu %6.2f%% %9lu %8lu\r\n",
			snap[i].name,
			snap[i].cycles,
			snap[i].min_cycles,
			snap[i].max_cycles,
			avg,
			(float)snap[i].cycles * 100.0f / (float)elapsed,
			snap[i].preempts,
			snap[i].invocs);
	}

	DEBUG_PRINTF("%-14.14s %10s %10s %10s %10s %6.2f%% %9s %8s\r\n",
		"Idle", "0", "0", "0", "0",
		(float)idle * 100.0f / (float)elapsed, "0", "0");

	DEBUG_PRINTF("%-14.14s %10lu %10s %10s %10s %6.2f%% %9s %8s\r\n",
		"ISR", isr_snapshot, "-", "-", "-",
		(float)isr_snapshot * 100.0f / (float)elapsed, "-", "-");

	float cpu_util = (float)(total + isr_snapshot) * 100.0f / (float)elapsed;
	float wake_rate = (float)_idle_wakeups / (float)elapsed_ms;
	DEBUG_PRINTF("\r\nCPU Util: %6.2f%% (wall %lu ms, active %lu cyc, %lu WFI/s)\r\n",
		cpu_util, elapsed_ms, elapsed, (uint32_t)(wake_rate * 1000.0f));
	DEBUG_PRINTF("=======================================================================================\r\n");
}

/**
 * @brief TIM7 interrupt handler - scheduler tick
 *
 * Increments the system tick counter and marks tasks ready when
 * their period has elapsed, then pends PendSV for context switch.
 */
void TIM7_IRQHandler(void){
	SCHEDULER_ISR_enter();
	uint32_t tim_flag;
	TIMER_GetFlag(TIM7, TIM_SR_UIF, &tim_flag);
	if (tim_flag) {
		TIMER_ClearFlag(TIM7, TIM_SR_UIF);

		_sys_tick_ms++;

		for (int i = 0; i < SCHEDULER_IDLE_TASK_INDEX; i++) {
			if (_tasks[i].active && _tasks[i].function != 0) {
				if ((_sys_tick_ms - _tasks[i].last_run_ms)
					>= _tasks[i].period_ms) {
					_tasks[i].last_run_ms = _sys_tick_ms;
					_tasks[i].ready       = 1;
				}
			}
		}

		SCB->ICSR |= SCB_ICSR_PENDSVSET_Msk;

		if (_scheduler_running
			&& (_sys_tick_ms - _last_print_tick >= 1000)) {
			_last_print_tick = _sys_tick_ms;
			_stats_pending = 1;
		}
	}
	SCHEDULER_ISR_exit();
}

// -------------------------------------------------------------------------
// Public API
// -------------------------------------------------------------------------

SCHEDULER_Status_TypeDef SCHEDULER_Task_add(
	SCHEDULER_TaskFunction_TypeDef pvTaskCode,
	const char* pcName,
	uint32_t period_ms,
	uint8_t priority,
	uint8_t* taskIndex){

	if (taskIndex == NULL)  { return SCHEDULER_ERR_NOT_FOUND;  }
	if (pvTaskCode == NULL) { return SCHEDULER_ERR_TASK_INVALID; }

	int slot = -1;
	for (int i = 0; i < SCHEDULER_IDLE_TASK_INDEX; i++) {
		if (!_tasks[i].active) {
			slot = i;
			break;
		}
	}

	if (slot < 0) { return SCHEDULER_ERR_FULL; }

	_tasks[slot].function	    = pvTaskCode;
	_tasks[slot].period_ms	    = period_ms;
	_tasks[slot].last_run_ms    = _sys_tick_ms;
	_tasks[slot].priority	    = priority;
	_tasks[slot].stack_overflow = 0;
	_tasks[slot].pcName         = pcName;

	SCHEDULER_InitTaskStack(slot);

	_tasks[slot].ready		    = 1;
	_tasks[slot].active		    = 1;

	*taskIndex = (uint8_t)slot;

	return SCHEDULER_OK;
}

SCHEDULER_Status_TypeDef SCHEDULER_Task_remove(int taskIndex){
	if (taskIndex < 0 || taskIndex >= SCHEDULER_IDLE_TASK_INDEX) {
		return SCHEDULER_ERR_NOT_FOUND;
	}

	_tasks[taskIndex].active     = 0;
	_tasks[taskIndex].function   = 0;
	_tasks[taskIndex].ready      = 0;
	_tasks[taskIndex].needs_init = 0;
	_tasks[taskIndex].pcName     = 0;

	return SCHEDULER_OK;
}

void SCHEDULER_System_init(void){
	TIMER_Config(TIM7, 400, 999, 0);
	TIMER_EnableIT(TIM7);

	CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk;
	DWT->CTRL |= DWT_CTRL_CYCCNTENA_Msk;
	uint32_t cnt = DWT->CYCCNT;
	_last_stats_print_cycle = cnt;
	_last_stats_tick = 0;
	for (int i = 0; i < SCHEDULER_MAX_TASKS; i++) {
		_task_stats[i].last_start_cycle = cnt;
		_task_stats[i].min_cycles = 0xFFFFFFFF;
		_task_stats[i].max_cycles = 0;
	}
}

SCHEDULER_Status_TypeDef SCHEDULER_Tick_get(uint32_t* tick){
	if (tick == 0) {
		return SCHEDULER_ERR_NOT_FOUND;
	}

	*tick = _sys_tick_ms;
	return SCHEDULER_OK;
}

void SCHEDULER_Tasks_run(void){
	__disable_irq();

	_tasks[SCHEDULER_IDLE_TASK_INDEX].function       = SCHEDULER_IdleTask;
	_tasks[SCHEDULER_IDLE_TASK_INDEX].period_ms      = 0;
	_tasks[SCHEDULER_IDLE_TASK_INDEX].last_run_ms    = 0;
	_tasks[SCHEDULER_IDLE_TASK_INDEX].priority       = 0xFF;
	_tasks[SCHEDULER_IDLE_TASK_INDEX].ready          = 1;
	_tasks[SCHEDULER_IDLE_TASK_INDEX].active         = 1;
	_tasks[SCHEDULER_IDLE_TASK_INDEX].needs_init     = 0;

	SCHEDULER_InitTaskStack(SCHEDULER_IDLE_TASK_INDEX);
	_tasks[SCHEDULER_IDLE_TASK_INDEX].pcName = "Idle";

	NVIC_SetPriority(PendSV_IRQn, 0xFF);
	NVIC_SetPriority(SVCall_IRQn, 0x00);
	NVIC_SetPriority(TIM7_IRQn, 0x80);

	FPU->FPCCR &= ~FPU_FPCCR_LSPEN_Msk;

	_current_task = SCHEDULER_SelectNextTask();

	// Enable ALL fault handlers so no crash goes undiagnosed
	SCB->SHCSR |= SCB_SHCSR_USGFAULTENA_Msk
				| SCB_SHCSR_BUSFAULTENA_Msk
				| SCB_SHCSR_MEMFAULTENA_Msk;

	// TIM7 is NOT started here - it starts in SCHEDULER_StartTick()
	// called from SVC_Handler after PSP and CONTROL are valid.
	// This prevents PendSV from ever firing before PSP is initialized.

	__enable_irq();

	__asm volatile ("SVC #0" : : : "memory");

	while (1) {
		__WFI();
	}
}

// -------------------------------------------------------------------------
// Debug API
// -------------------------------------------------------------------------

SCHEDULER_Status_TypeDef SCHEDULER_GetCurrentTask(int* taskIndex){
	if (taskIndex == 0) { return SCHEDULER_ERR_NOT_FOUND; }
	*taskIndex = _current_task;
	return SCHEDULER_OK;
}

SCHEDULER_Status_TypeDef SCHEDULER_GetLastFault(
	volatile const Scheduler_Fault_Dump_TypeDef** dump){

	if (dump == 0) { return SCHEDULER_ERR_NOT_FOUND; }
	*dump = &g_sched_fault;
	return SCHEDULER_OK;
}

SCHEDULER_Status_TypeDef SCHEDULER_GetTaskName(uint8_t task,
	const char** name){

	if (task >= SCHEDULER_MAX_TASKS) { return SCHEDULER_ERR_NOT_FOUND; }
	if (name == 0)                   { return SCHEDULER_ERR_NOT_FOUND; }
	*name = _tasks[task].pcName;
	return SCHEDULER_OK;
}

// -------------------------------------------------------------------------
// Fault handler - C core (captures state, then halts)
// -------------------------------------------------------------------------

/**
 * @brief Central fault handler - capture diagnostic state and halt
 *
 * @param [in] exc_return EXC_RETURN value from the fault context
 * @param [in] frame      Stack frame pointer (may be NULL)
 * @param [in] reason     Fault reason identifier
 */

